Vapi27/gottfa-esp32/src/arena_net.cpp
  int status = 0; long len = -1;
  const uint32_t tHdr = millis();
  while (true) {
    if (millis() - tHdr > 15000) { err = "timeout en-tetes"; return false; }
    if (!c.available()) {
      if (!c.connected()) { err = "coupe pendant les en-tetes"; return false; }
      delay(5); continue;
    }
    String line = c.readStringUntil('\n'); line.trim();
    if (line.length() == 0) break;                       // fin des en-tetes
    if (!status && line.startsWith("HTTP/")) status = line.substring(9, 12).toInt();
    String low = line; low.toLowerCase();
    if (low.startsWith("content-length:")) len = line.substring(15).toInt();
  }
  if (status != 200) { err = "HTTP " + String(status); return false; }
  if (len <= 0) { err = "Content-Length absent (chunked non gere)"; return false; }

  // Deux destinations : l'application (via esp_ota_*) ou la partition du
  // systeme de fichiers, qui porte l'interface web. La seconde s'ecrit a la
  // main - il n'y a pas d'API "ota" pour elle - et LittleFS doit etre demonte
  // avant, sinon on reecrit sous les pieds du serveur qui vient de servir la page.
  const esp_partition_t* part = fs
      ? esp_partition_find_first(ESP_PARTITION_TYPE_DATA,
                                 ESP_PARTITION_SUBTYPE_DATA_SPIFFS, NULL)
      : esp_ota_get_next_update_partition(NULL);
  if (!part) { err = fs ? "partition fichiers introuvable" : "aucune partition OTA libre"; return false; }
  if ((size_t)len > part->size) {
    err = "image trop grande (" + String((uint32_t)len) + " > " + String(part->size) + ")";
    return false;
  }

  esp_ota_handle_t h = 0;
  esp_err_t e = ESP_OK;
  if (fs) {
    LittleFS.end();
    e = esp_partition_erase_range(part, 0, (((size_t)len) + 4095) & ~((size_t)4095));
    if (e != ESP_OK) { err = String("erase: ") + esp_err_to_name(e); return false; }
  } else {
    e = esp_ota_begin(part, (size_t)len, &h);
    if (e != ESP_OK) { err = String("esp_ota_begin: ") + esp_err_to_name(e); return false; }
  }

  s_pullTotal = (uint32_t)len;
  s_pullDone  = 0;
  static uint8_t buf[1460];                              // statique : pas sur la pile
  uint32_t tLast = millis();
  while (s_pullDone < (uint32_t)len) {
    const int n = c.read(buf, sizeof(buf));
    if (n > 0) {
      e = fs ? esp_partition_write(part, s_pullDone, buf, (size_t)n)
             : esp_ota_write(h, buf, (size_t)n);
      if (e != ESP_OK) {
        if (!fs) esp_ota_abort(h);
        err = String(fs ? "partition_write: " : "esp_ota_write: ") + esp_err_to_name(e);
        return false;
      }
      s_pullDone += (uint32_t)n;
      tLast = millis();
      // Respiration obligatoire : sans elle cette boucle monopolise le coeur et
      // le task watchdog tue la tache IDLE. 1 ms par paquet de 1460 octets
      // plafonne a ~1,4 Mo/s, tres au-dessus du debit reseau reel.
      delay(1);
    } else {
      if (!c.connected() && !c.available()) break;
      if (millis() - tLast > 20000) { esp_ota_abort(h); err = "timeout reception"; return false; }
      delay(2);
    }
  }
  if (s_pullDone != (uint32_t)len) {
    if (!fs) esp_ota_abort(h);
    err = "tronque " + String(s_pullDone) + "/" + String((uint32_t)len);
    return false;
  }
  if (fs) return true;                       // rien a valider : le redemarrage remonte LittleFS
  e = esp_ota_end(h);
  if (e != ESP_OK) { err = String("esp_ota_end: ") + esp_err_to_name(e); return false; }
  e = esp_ota_set_boot_partition(part);
  if (e != ESP_OK) { err = String("set_boot: ") + esp_err_to_name(e); return false; }
  return true;
}

void resetNetwork() {
  s_prefs.clear();
  Serial.println("[net] nom et identifiants WiFi effaces");
}

void forgetHomes() {
#ifdef ARENA_MATTER
  arena_matter_forget();
#else
  Serial.println("[net] pas de Matter dans cette image - rien a oublier");
#endif
}

static String stateJson() {
  arenaled::Rgbw c = arenaled::color();
  String j = "{";
  j += "\"fw\":\"" ARENA_FW_VERSION "\"";
  j += ",\"mode\":\"" + String(arenaled::modeName(arenaled::mode())) + "\"";
  j += ",\"bright\":" + String(arenaled::brightness());
  j += ",\"speed\":"  + String(arenaled::speed());
  j += ",\"gi\":"     + String(arenaled::gi());
  j += ",\"density\":" + String(arenaled::density());
  j += ",\"warm\":"   + String(arenaled::warm());
  j += ",\"inc\":"    + String(arenaled::incandescent() ? 1 : 0);
  j += ",\"boot\":"   + String(arenaled::bootOn() ? 1 : 0);
  // What the wall is running: seconds of ROM attract (0 = generic fallback)
  // and how many inserts the plan carries. The Game panel reads these.
  j += ",\"atr\":"    + String(arenaattract::available()
                              ? arenaattract::frames() * arenaattract::stepMs() / 1000 : 0);
  j += ",\"ins\":"    + String(arenapf::insertCount());
  j += ",\"fsu\":"    + String(LittleFS.usedBytes());
  j += ",\"fst\":"    + String(LittleFS.totalBytes());
  j += ",\"count\":"  + String(arenaled::count());
  j += ",\"max\":"    + String(LED_MAX);
  j += ",\"r\":" + String(c.r) + ",\"g\":" + String(c.g) +
       ",\"b\":" + String(c.b) + ",\"w\":" + String(c.w);
  j += ",\"amps\":"   + String(arenaled::lastAmps(), 2);
  // Also in mA: two decimals of an amp cannot show a bench of one or three LEDs
  // (a single pixel in TEST mode is ~4 mA, which prints as "0.00" and reads like
  // a broken meter). mA is what the multimeter in the +5 V wire shows anyway.
  j += ",\"ma\":"     + String(arenaled::lastAmps() * 1000.0f, 1);
  j += ",\"budget\":" + String(arenaled::budgetMa());
  j += ",\"order\":\""  + String(arenaled::order()) + "\"";
  j += ",\"limited\":" + String(arenaled::limited() ? "true" : "false");
  j += ",\"fps\":"    + String(arenaled::fps());
  // Diagnostic sortie LED : pin reellement compilee, trames emises, echecs.
  j += ",\"pin\":"      + String(PIN_LED_DATA);
  // Le repeteur decide si le 1er pixel physique est tenu eteint. C'est le
  // reglage qui explique "les LED ne s'allument pas" une fois sur deux, et il
  // n'etait expose NULLE PART : ni la page ni /api/state ne disaient sa valeur,
  // donc personne ne pouvait verifier ce qu'il venait de changer.
  j += ",\"repeater\":" + String(arenaled::repeater() ? 1 : 0);
  j += ",\"rmtframes\":" + String((uint32_t)espShowFrames);
  j += ",\"rmtfail\":"  + String((uint32_t)espShowRmtFail);
  j += ",\"lockmiss\":" + String((uint32_t)espShowLockMiss);
  // Rendu gele pendant un appairage BLE. Sans ce champ, fps/ma/rmtframes figes
  // ressemblent a s'y meprendre a un rendu normal.
  j += ",\"paused\":" + String(arenaled::paused() ? "true" : "false");
  // L'ecran a-t-il repondu sur l'I2C au demarrage ? Sans ce temoin, un panneau
  // muet est indiscernable d'un panneau absent, d'une mauvaise adresse ou d'un
  // fil inverse - et il n'y a pas de port serie sur un mur accroche.
  j += ",\"oled\":" + String(arenaoled::found() ? "true" : "false");
  j += ",\"bustype\":"  + String((int32_t)espShowBusType);
  // Memoire. C'est ce qui decide si la PSRAM est necessaire : ce qui compte
  // n'est pas le total mais le plus BAS jamais atteint, car le manque de tas ne
  // se manifeste qu'a la pointe - typiquement la poignee de main d'appairage.
  j += ",\"heap\":"    + String((uint32_t)ESP.getFreeHeap());
  j += ",\"heapmin\":" + String((uint32_t)ESP.getMinFreeHeap());
  j += ",\"heapblk\":" + String((uint32_t)ESP.getMaxAllocHeap());
  j += ",\"psram\":"   + String((uint32_t)ESP.getFreePsram());

  // Retour arriere OTA : l'etat de l'image qui tourne. C'est ce qui dit si le
  // filet est reellement arme, et un cable serie n'est pas une facon durable de
  // le verifier - une OTA reenumere l'USB natif et le port disparait.
  //   "trial"   installee, pas encore declaree saine : un redemarrage revient
  //             a l'ancienne image
  //   "valid"   declaree saine, plus de retour en arriere
  //   "nofw"    le bootloader n'a pas le retour arriere (option absente)
  {
    esp_ota_img_states_t ost;
    const esp_partition_t* rp = esp_ota_get_running_partition();
    const char* v = "nofw";
    if (rp && esp_ota_get_state_partition(rp, &ost) == ESP_OK) {
      if      (ost == ESP_OTA_IMG_PENDING_VERIFY) v = "trial";
      else if (ost == ESP_OTA_IMG_VALID)          v = "valid";
      else if (ost == ESP_OTA_IMG_UNDEFINED)      v = "nofw";
      else                                        v = "other";
    }
    j += ",\"otavalid\":\"" + String(v) + "\"";
    j += ",\"slot\":\"" + String(rp ? rp->label : "?") + "\"";
  }

  // Les autres murs vus sur le reseau, et le comportement choisi face a eux.
  j += ",\"link\":\"" + String(arenapeers::linkName(arenapeers::link())) + "\"";
  j += ",\"rank\":"  + String((int)arenapeers::rank());
  j += ",\"shared\":" + String(arenapeers::sharedPower() ? 1 : 0);
  j += ",\"share\":"  + String((int)arenaled::budgetShare());
  j += ",\"peers\":" + arenapeers::json();

  // Defaut du limiteur de sortie : le seul signal materiel qui dit qu'il se
  // passe quelque chose AU BOUT du cable, la ou personne ne regarde.
  j += ",\"ledfault\":"  + String(arenaled::ledFault() ? 1 : 0);
  j += ",\"ledfaultn\":" + String((int)arenaled::ledFaultCount());

