Vapi27/gottfa-esp32/src/arena_net.cpp
  // /api/latch?n=L9,L48   lamps held lit through attract, by the MACHINE's name
  // /api/latch?clear=1    release them all
  // Named, not numbered: the owner reads L9 off the playfield, and the mask
  // underneath is in PinMAME's numbering, which nobody should have to know.
  s_server.on("/api/latch", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (r->hasParam("clear")) { arenaled::setLatched(0); arenaled::save(); }
    else if (r->hasParam("n")) {
      uint64_t m = 0;
      String list = r->getParam("n")->value();
      list.trim();
      int start = 0;
      while (start < (int)list.length()) {
        int comma = list.indexOf(',', start);
        if (comma < 0) comma = list.length();
        String one = list.substring(start, comma);
        one.trim();
        start = comma + 1;
        if (!one.length()) continue;
        const int idx = arenapf::indexOf(one.c_str());
        const arenapf::Insert* ins = (idx >= 0) ? arenapf::insert((uint8_t)idx) : nullptr;
        if (!ins || ins->lamp < 0) {
          r->send(400, "text/plain", "unknown insert: " + one);
          return;
        }
        m |= (1ULL << ins->lamp);
      }
      arenaled::setLatched(m);
      arenaled::save();
    }
    // Answer in the owner's names, not in the internal mask.
    String out = "{\"latched\":[";
    bool first = true;
    const uint64_t m = arenaled::latched();
    for (uint8_t i = 0; i < arenapf::insertCount(); i++) {
      const arenapf::Insert* ins = arenapf::insert(i);
      if (!ins || ins->lamp < 0 || !((m >> ins->lamp) & 1ULL)) continue;
      if (!first) out += ',';
      first = false;
      out += "\"" + String(ins->name) + "\"";
    }
    out += "]}";
    r->send(200, "application/json", out);
  });

  //  /api/music?e=..&b=..&t=..   0..255 — drive the music mode from anything
  //  that can hit REST at ~20 Hz. Overrides the on-board mic for 2 s per push.
  s_server.on("/api/music", HTTP_GET, [](AsyncWebServerRequest* r) {
    arenaled::musicPush(param8(r, "e", 0), param8(r, "b", 0), param8(r, "t", 0));
    r->send(200, "text/plain", "ok");
  });

  s_server.on("/api/save", HTTP_GET, [](AsyncWebServerRequest* r) {
    arenaled::save();
    r->send(200, "text/plain", "saved");
  });

  // --- Mapping wizard -----------------------------------------------------
  //  /api/identify?led=42 | ?zone=3 | ?clear=1   (ms= optional, default 10 s)
  s_server.on("/api/identify", HTTP_GET, [](AsyncWebServerRequest* r) {
    uint32_t ms = r->hasParam("ms") ? (uint32_t)r->getParam("ms")->value().toInt() : 10000;
    if (r->hasParam("clear"))     arenaled::clearIdentify();
    else if (r->hasParam("led"))  arenaled::identifyLed(r->getParam("led")->value().toInt(), ms);
    else if (r->hasParam("zone")) arenaled::identifyZone(r->getParam("zone")->value().toInt(), ms);
    else { r->send(400, "text/plain", "led= | zone= | clear=1"); return; }
    r->send(200, "text/plain", "ok");
  });

  // ---- Sub-paths must be registered BEFORE their parent --------------------
  // This server matches a handler when the request URL equals its URI *or*
  // starts with it followed by '/'. So "/api/zones" also answers
  // "/api/zones/reset", and whichever was registered first wins. Registered the
  // other way round, /api/zones/reset silently returned the zone list and the
  // UI's "Reset to template" button did nothing at all - which is exactly what
  // it had been doing, unnoticed, since there was no hardware to try it on.
  s_server.on("/api/zones/reset", HTTP_GET, [](AsyncWebServerRequest* r) {
    arenamap::reset();
    arenamap::save();
    r->send(200, "application/json", arenamap::toJson());
  });

  s_server.on("/api/ledmap/reset", HTTP_GET, [](AsyncWebServerRequest* r) {
    arenapf::clearAssignment();
    arenapf::save();
    r->send(200, "text/plain", "cleared");
  });

  // Un pixel rejoint ou quitte un groupe, un par un : c'est le geste de la
  // cartographie a la main. Un groupe n'etant plus une plage, il n'y a pas
  // d'autre facon de decrire "ce bumper-la et celui d'en face, pas ce qu'il y a
  // entre les deux".
  //   /api/zone/assign?led=37&z=4     -> le pixel 37 rejoint le groupe 4
  //   /api/zone/assign?led=37&z=-1    -> il n'appartient plus a rien
  s_server.on("/api/zone/assign", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("led") || !r->hasParam("z")) {
      r->send(400, "text/plain", "led= et z= requis (z=-1 pour retirer)");
      return;
    }
    const long led = r->getParam("led")->value().toInt();
    const long z   = r->getParam("z")->value().toInt();
    if (led < 0 || led >= LED_MAX) { r->send(400, "text/plain", "led hors chaine"); return; }
    const uint8_t zz = (z < 0) ? arenamap::ZONE_NONE : (uint8_t)z;
    if (!arenamap::setLedZone((uint16_t)led, zz)) {
      r->send(400, "text/plain", "groupe inconnu");
      return;
    }
    arenamap::save();
    r->send(200, "application/json", arenamap::toJson());
  });

  // Creer / renommer / supprimer un groupe sans reecrire toute la table.
  //   /api/zone/add?n=pop-bumpers          -> groupe vide, a remplir pixel par pixel
  //   /api/zone/name?z=4&n=eclairage
  //   /api/zone/del?z=4
  s_server.on("/api/zone/add", HTTP_GET, [](AsyncWebServerRequest* r) {
    const String n = r->hasParam("n") ? r->getParam("n")->value() : String("groupe");
    if (!arenamap::addZone(n.c_str(), 0, 0)) { r->send(400, "text/plain", "table pleine"); return; }
    arenamap::save();
    r->send(200, "application/json", arenamap::toJson());
  });
  s_server.on("/api/zone/name", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("z") || !r->hasParam("n")) { r->send(400, "text/plain", "z= et n= requis"); return; }
    if (!arenamap::renameZone((uint8_t)r->getParam("z")->value().toInt(),
                              r->getParam("n")->value().c_str())) {
      r->send(400, "text/plain", "groupe inconnu"); return;
    }
    arenamap::save();
    r->send(200, "application/json", arenamap::toJson());
  });
  s_server.on("/api/zone/del", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("z")) { r->send(400, "text/plain", "z= requis"); return; }
    if (!arenamap::removeZone((uint8_t)r->getParam("z")->value().toInt())) {
      r->send(400, "text/plain", "groupe inconnu"); return;
    }
    arenamap::save();
    r->send(200, "application/json", arenamap::toJson());
  });

