Vapi27/gottfa-esp32/src/arena_net.cpp
    // Une OTA qui echoue a moitie laisse une carte muette, et le proprietaire
    // n a alors plus de page pour lire pourquoi. Donc on le dit AVANT.
    // Un defaut materiel CONNU, ecrit dans le BOM depuis la conception. Sans
    // cette section, chaque proprietaire le redecouvre a ses frais - et le
    // cherche dans le firmware, ou il n'est pas.
    t += "-- Le temoin de statut (D2) --\n";
    t += "allume       : " + String(s_statOn ? "oui" : "non") +
         "   luminosite " + String(s_statBright) + "/255\n";
    t += "  D2 est un WS2812B-2020. La carte l alimente en 3,3 V alors que sa\n";
    t += "  fiche demande 3,5 a 5,3 V : il tourne SOUS son minimum. C est ecrit\n";
    t += "  dans hardware/BOM_PCB.csv depuis la conception, avec la raison - le\n";
    t += "  couloir vers la zone +5 V etait sature au routage, et rouvrir une\n";
    t += "  region qui marche pour un temoin ne valait pas le risque.\n";
    t += "  Un exemplaire hors spec ne s eteint pas : il lit mal sa donnee et\n";
    t += "  sort du BLANC PLEIN, insensible a la couleur ET a la luminosite\n";
    t += "  qu on lui envoie. Aucun reglage ici n y changera quoi que ce soit.\n";
    t += "  Le rattrapage est prevu, dix minutes au fer : un fil de quelques mm\n";
    t += "  entre +5 V et la broche 4 de D2, avec une 1N4148 en l air (cathode\n";
    t += "  vers D2). VDD passe a ~4,3 V, dans la plage.\n";
    t += "  En attendant : /api/set?statusled=0 l eteint plutot que de laisser\n";
    t += "  un temoin qui ment.\n\n";

    t += "-- La flash --\n";
    t += "puce         : " + String(s_flashPhys >> 20) + " Mo (identifiant JEDEC)\n";
    t += "table        : jusqu a " + String(s_partEnd >> 20) + " Mo\n";
    if (s_flashBad) {
      t += "  ATTENTION : la table depasse la puce. Les partitions du haut -\n";
      t += "  OTA et fichiers - pointent dans le vide. Une OTA s ecrirait\n";
      t += "  par-dessus elle-meme. Corriger board_build.partitions dans\n";
      t += "  platformio.ini et reflasher par cable AVANT toute OTA.\n\n";
    } else if (!s_flashPhys) {
      t += "  Taille physique illisible : verifier a la main avant une OTA.\n\n";
    } else {
      t += "  La table tient dans la puce.\n\n";
    }

    t += "-- Les LED --\n";
    t += "broche data  : GPIO" + String(arenaled::pin()) +
         "   (essayer une autre sans reflasher : /api/set?pin=N)\n";
    t += "pixels pilotes: " + String(arenaled::count());
    if (arenaled::repeater()) {
      t += " visibles + 1 repeteur = " + String(arenaled::count() + 1) + " a cabler\n";
      t += "  ATTENTION : le 1er pixel physique est tenu ETEINT expres (repeteur).\n";
      t += "  Avec une seule LED cablee, elle ne s allumera JAMAIS. Il en faut 2,\n";
      t += "  Pas de repeteur sur ta chaine ? -> /api/set?repeater=0\n";
    } else {
      t += " (pas de repeteur)\n";
    }
    t += "mode         : " + String(arenaled::modeLabel(arenaled::mode())) + "\n";
    t += "luminosite   : " + String(arenaled::brightness()) + "/255\n";
    t += "courant      : " + String(arenaled::lastAmps(), 2) + " A\n";
    t += "ordre couleur: " + String(arenaled::order()) + "\n\n";

    t += "-- Temoin de la carte --\n";
    t += "pixel statut : GPIO" + String(s_statPin) +
         "   (autre broche : /api/set?statuspin=N)\n";
    t += "  ambre=demarrage  bleu=point d acces  vert=reseau  rouge=defaut\n";
    t += "  Toujours eteint ? La broche n est pas la bonne : essaie 48, 38, 8, 2.\n\n";

    t += "-- Boutons (au repos, les trois doivent lire 'haut') --\n";
    {
      bool bu = false, bo = false, bd = false;
      uint32_t nu = 0, no = 0, nd = 0;
      arenaoled::btnRaw(bu, bo, bd, nu, no, nd);
      uint8_t pu, pd, po;
      arenaoled::buttons(pu, pd, po);
      t += "gauche GPIO" + String(pu) + " : " + (bu ? "BAS (enfonce !)" : "haut") + "   declenche " + String(nu) + "x\n";
      t += "OK     GPIO" + String(po) + " : " + (bo ? "BAS (enfonce !)" : "haut") + "   declenche " + String(no) + "x\n";
      t += "droite GPIO" + String(pd) + " : " + (bd ? "BAS (enfonce !)" : "haut") + "   declenche " + String(nd) + "x\n";
      t += "  Un poussoir qui repond mais dans le mauvais sens n'est pas un bug :\n";
      t += "  la netlist nomme des nets, pas des positions. Remapper sans\n";
      t += "  reflasher : /api/set?btnup=<gauche>&btndown=<droite>&btnok=<ok>\n";
      t += "  Sans lire un seul numero de broche : /api/set?btnrot=1 decale les\n";
      t += "  trois roles d'un cran. Au pire deux fois, et c'est dans le bon sens.\n";
      if (bu || bo || bd)
        t += "  !! Une entree est BASSE sans que tu touches rien. Cette broche n est\n"
             "     pas cablee a ce poussoir, ou il est colle. Un OK bloque bas part en\n"
             "     appui long : ecran noir, reveil, rebelote - exactement le symptome.\n";
      t += "\n";
    }

    t += "-- Reseau --\n";
    t += "mode         : " + s_mode + "  ip " + s_ip + "\n";
    t += "dernier echec: " + (s_staReason.length() ? s_staReason : String("(aucun essai)")) + "\n";
    t += "erreur scan  : " + (s_scanErr.length() ? s_scanErr : String("(aucune)")) + "\n";
    r->send(200, "text/plain; charset=utf-8", t);
  });

  s_server.on("/api/wifiscan", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (r->hasParam("results")) {
      wifi_ap_record_t apInfo = {};
      const bool apInfoOk = (esp_wifi_sta_get_ap_info(&apInfo) == ESP_OK);
      String j = "{\"fail\":\"" + s_staReason + "\"" +
                 ",\"scanErr\":\"" + s_scanErr + "\"" +
                 ",\"age\":" + String(s_scanAt ? (millis() - s_scanAt) / 1000 : 9999) +
                 ",\"busy\":" + String(s_scanWanted ? "true" : "false") +
                 ",\"rssi\":" + String(apInfoOk ? (int)apInfo.rssi : 0) +
                 ",\"ssid\":\"" + String(apInfoOk ? (const char*)apInfo.ssid : "") + "\"" +
                 ",\"nets\":" + s_scanJson + "}";
      r->send(200, "application/json", j);
      return;
    }
    s_scanWanted = true;
    r->send(200, "text/plain", "scan lance");
  });

  s_server.on("/api/fw", HTTP_POST,
    [](AsyncWebServerRequest* r) {
      // --- begin : reserve et efface, une bonne fois ---
      if (r->hasParam("begin")) {
        const size_t sz = (size_t)r->getParam("begin")->value().toInt();
        if (sz < 65536) { r->send(400, "text/plain", "taille invalide"); return; }
        if (s_fwHandle) { esp_ota_abort(s_fwHandle); s_fwHandle = 0; }
        s_fwPart = esp_ota_get_next_update_partition(NULL);
        if (!s_fwPart) { r->send(500, "text/plain", "aucune partition OTA"); return; }
        if (sz > s_fwPart->size) { r->send(400, "text/plain", "image trop grande"); return; }
        // Taille reelle, pas OTA_SIZE_UNKNOWN : on efface ce qu'on ecrit, pas
        // les 3 Mo de la partition.
        const esp_err_t e = esp_ota_begin(s_fwPart, sz, &s_fwHandle);
        if (e != ESP_OK) {
          s_fwHandle = 0;
          r->send(500, "text/plain", String("esp_ota_begin: ") + esp_err_to_name(e));
          return;
        }
        s_fwTotal = sz; s_fwGot = 0;
        r->send(200, "text/plain", "pret");
        return;
      }
      // --- end : valide et redemarre ---
      if (r->hasParam("end")) {
        if (!s_fwHandle) { r->send(409, "text/plain", "aucun envoi en cours"); return; }
        if (s_fwGot != s_fwTotal) {
          esp_ota_abort(s_fwHandle); s_fwHandle = 0;
          r->send(400, "text/plain", "tronque " + String(s_fwGot) + "/" + String(s_fwTotal));
          return;
        }
        esp_err_t e = esp_ota_end(s_fwHandle);
        s_fwHandle = 0;
        if (e != ESP_OK) { r->send(400, "text/plain", String("image refusee: ") + esp_err_to_name(e)); return; }
        e = esp_ota_set_boot_partition(s_fwPart);
        if (e != ESP_OK) { r->send(500, "text/plain", String("set_boot: ") + esp_err_to_name(e)); return; }
        r->send(200, "text/plain", "ok, redemarrage");
        s_fwReboot = millis();          // laisse la reponse partir avant de couper
        return;
      }
      // --- abandon explicite ---
      if (r->hasParam("abort")) {
        if (s_fwHandle) { esp_ota_abort(s_fwHandle); s_fwHandle = 0; }
        s_fwGot = s_fwTotal = 0;
        r->send(200, "text/plain", "abandonne");
        return;
      }
      // --- un morceau : la reponse part ICI, apres l'ecriture ---
      if (!s_fwHandle) { r->send(409, "text/plain", "appelle ?begin= d'abord"); return; }
      r->send(200, "text/plain", String(s_fwGot));
    },
    NULL,
    // Corps brut du morceau. Ecrit au fil de l'eau : un morceau de 32 ko tient
    // dans les tampons, et l'acquittement ci-dessus ne part qu'une fois ecrit.
    [](AsyncWebServerRequest* r, uint8_t* data, size_t len, size_t index, size_t total) {
      if (!s_fwHandle || !len) return;
      if (esp_ota_write(s_fwHandle, data, len) != ESP_OK) {
        esp_ota_abort(s_fwHandle); s_fwHandle = 0;
        return;
      }
      s_fwGot += len;
    });

  s_server.on("/api/otapull", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("url")) { r->send(400, "text/plain", "url= manquant"); return; }
    if (s_pullPending) { r->send(409, "text/plain", "un telechargement est deja en cours"); return; }
    s_pullUrl     = r->getParam("url")->value();
    s_pullDone    = 0;
    s_pullTotal   = 0;
    s_pullFs      = r->hasParam("target") && r->getParam("target")->value() == "fs";
    s_pullStatus  = "demarre";
    s_pullPending = true;   // la boucle principale prend le relais
    r->send(200, "text/plain", "telechargement lance depuis " + s_pullUrl +
                               "\nsuivre otast / otadone / otatot dans /api/state");
  });

  s_server.on("/update", HTTP_POST,
    [](AsyncWebServerRequest* r) {
      bool ok = !Update.hasError();
      r->send(ok ? 200 : 500, "text/plain", ok ? "OK, rebooting" : "FAIL");
      if (ok) { delay(200); ESP.restart(); }
    },
    [](AsyncWebServerRequest* r, String fn, size_t idx, uint8_t* data, size_t len, bool done) {
      if (!idx) {
        const bool fs = r->hasParam("target") && r->getParam("target")->value() == "fs";
        Serial.printf("[ota] start %s -> %s\n", fn.c_str(), fs ? "filesystem" : "app");
        if (fs) LittleFS.end();                      // cannot be mounted while it is rewritten
        // Taille reelle plutot que UPDATE_SIZE_UNKNOWN : ce dernier efface la
        // partition entiere (3 Mo) d'un bloc et gele AsyncTCP le temps que ca
        // dure, ce qui est la cause du plantage decrit devant pullOta().
        const size_t sz = r->contentLength() ? r->contentLength() : UPDATE_SIZE_UNKNOWN;
        if (!Update.begin(sz, fs ? U_SPIFFS : U_FLASH)) Update.printError(Serial);
      }
      if (Update.write(data, len) != len) Update.printError(Serial);
      if (done) {
        if (Update.end(true)) Serial.printf("[ota] ok %u bytes\n", (unsigned)(idx + len));
        else Update.printError(Serial);
      }
    });

  s_server.serveStatic("/", LittleFS, "/");
  s_server.onNotFound([](AsyncWebServerRequest* r) { r->send(404, "text/plain", "404"); });
  s_server.begin();
}

// Codes de deconnexion de l'IDF, traduits. Les trois premiers couvrent
// l'immense majorite des cas sur une installation domestique.
static const char* staReasonName(uint8_t r) {
  switch (r) {
    case WIFI_REASON_NO_AP_FOUND:        return "reseau introuvable (SSID exact ? 2,4 GHz ?)";
    case WIFI_REASON_AUTH_FAIL:          return "authentification refusee (mot de passe)";
    case WIFI_REASON_HANDSHAKE_TIMEOUT:  return "handshake expire (mot de passe, ou signal trop faible)";
    case WIFI_REASON_ASSOC_FAIL:         return "association refusee par le routeur";
    case WIFI_REASON_AUTH_EXPIRE:        return "authentification expiree";
    case WIFI_REASON_BEACON_TIMEOUT:     return "balise perdue (hors de portee)";
    case WIFI_REASON_CONNECTION_FAIL:    return "connexion refusee";
    default:                             return "echec";
  }
}

